/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package info.aservices.ftk6.dc;

import info.aservices.ftk6.dc.entities.Account;
import info.aservices.ftk6.dc.entities.Person;

import java.io.File;
import java.math.BigDecimal;
import java.util.ArrayList;
import java.util.Collection;
import java.util.List;
import java.util.Random;
import javax.ejb.EJB;
import javax.ejb.Stateless;
import javax.persistence.EntityManager;
import javax.persistence.PersistenceContext;

/**
 * @author andy
 */
@Stateless
public class PopulateDumpSession implements PopulateDumpRemote {

    final String[] names;
    final String[] patronymicNames;
    final String[] lastNames;
    @EJB
    FinancialOperationsLocal financialOperations;
    @PersistenceContext(unitName = "ESystem-ejbPU")
    private EntityManager em;

    public PopulateDumpSession() {
        names = loadNames();
        patronymicNames = loadPatronymicNames();
        lastNames = loadLastNames();
    }


    /**
     * Наполняет хранилище данными.
     */
    @Override
    public void populateIfEmpty() {
        Long personsCount = (Long)em.createQuery("SELECT COUNT(p) FROM Person p").getSingleResult();
        if (personsCount == 0) {
            populate();
        }
    }

    @Override
    public void populate() {
        int personsCnt = 100;
        long minimalBalance = 0;
        long maximalBalance = 4000;
        int minAccountsPerPerson = 1;
        int maxAccountsPerPerson = 5;
        int minimalTransfersCount = 0;
        int maximumTransfersCount = 100;
        long minimalTransfer = 10;
        long maximalTransfer = 2000;

        Collection<Account> allAccountsContainer = new ArrayList<>();
        Account[] allAccounts;

        for (int i = 0; i < personsCnt; i++) {
            Person person = new Person();
            person.setFirstName(getRandomName());
            person.setPatronymicName(getRandomPatronymicName());
            person.setLastName(getRandomLastName());
            em.persist(person);

            long accountsCnt = Math.round(Math.random() * (maxAccountsPerPerson - minAccountsPerPerson));
            for (int j = 0; j < accountsCnt; j++) {
                Account account = new Account();
                allAccountsContainer.add(account);
                long cents = Math.round(10 * (minimalBalance + Math.random() * maximalBalance));
                person.getAccountCollection().add(account);
                account.setPerson(person);
                account.setBalance(BigDecimal.ZERO);
                em.persist(account);
                BigDecimal newBalance = new BigDecimal(cents).movePointLeft(2);
                financialOperations.Recharge(account, newBalance);
            }

        }

        allAccounts = new Account[allAccountsContainer.size()];

        int ix = 0;
        for (Account a: allAccountsContainer) {
            allAccounts[ix] = a;
            ix++;
        }

        int count = 0;
        for (Account remitter: allAccounts) {
            int transfersCount = minimalTransfersCount + (int)(Math.random()*(maximumTransfersCount - minimalTransfersCount));
            for (int t = 0; t < transfersCount; t++) {
                Account beneficiary = getRandomAccount(allAccounts, remitter);
                int cents = (int) (minimalTransfer + (maximalTransfer - minimalTransfer) * Math.random()) * 100;
                BigDecimal amount = new BigDecimal((float) (cents / 100));

                financialOperations.Transfer(remitter, beneficiary, amount, "Transfer # " + count);
                count++;
            }
        }
    }

    private <T> T getRandomListValue(T[] list) {
        int ix = (int)(Math.random()*(list.length - 1));
        return list[ix];
    }

    private Account getRandomAccount(Account[] accounts, Account exceptThat) {
        Account a = getRandomListValue(accounts);
        while (a.getId().equals(exceptThat.getId())) {
            a = getRandomListValue(accounts);
        }
        return a;
    }

    private String getRandomName() { return getRandomListValue(names); };
    private String getRandomPatronymicName() { return getRandomListValue(patronymicNames); };
    private String getRandomLastName() { return getRandomListValue(lastNames); };

    private String[] loadNames() {
        return new String[]{"Абрам", "Аваз", "Аввакум", "Август", "Августин", "Авдей", "Авенир", "Аверьян", "Авксентий",
                "Автандил", "Агап", "Агафон", "Агей", "Адам", "Адильхан", "Адис", "Адольф", "Адриан", "Азад", "Азамат",
                "Азар", "Азарий", "Азиз", "Акакий", "Аким", "Алан", "Александр", "Алексей", "Али", "Алим", "Алискер",
                "Алихан", "Алоис", "Алферий", "Альберт", "Альбин", "Альфред", "Алянур", "Амадей", "Амадеус", "Амаяк",
                "Амвросий", "Анастас", "Анатолий", "Анвар", "Ангел", "Андоим", "Андрей", "Андрон", "Андроп", "Анжей",
                "Аникита", "Анисим", "Антип", "Антон", "Ануфрий", "Анфим", "Аполлон", "Арам", "Ардалион", "Арий",
                "Аристарх", "Аристон", "Аркадий", "Арно", "Арнольд", "Арон", "Арсен", "Арслан", "Арулан", "Арье",
                "Артамон", "Артем", "Артемий", "Артур", "Архип", "Аршак", "Аршиддин", "Аскар", "Аскольд", "Атанас",
                "Афанасий", "Афиноген", "Африкан", "Ахмет", "Ашот", "Бадри", "Базан", "Байракдар", "Бари", "Барузда",
                "Батыр", "Бахрам", "Бахыт", "Бежен", "Бек", "Бенедикт", "Берек", "Бернар", "Бертран", "Богдан",
                "Боголюб", "Болеслав", "Бонифаций", "Боримир", "Борис", "Борислав", "Боян", "Брачислав", "Бронислав",
                "Бруно", "Будимир", "Булат", "Вавила", "Ваган", "Вадим", "Валентин", "Валерий", "Валерьян", "Вали",
                "Вальтер", "Варлаам", "Варсонофий", "Варфоломей", "Василий", "Васим", "Велизар", "Велор", "Венедикт",
                "Вениамин", "Викентий", "Виктор", "Вилен", "Вилли", "Вильгельм", "Вильям", "Винсент", "Виргилий",
                "Виссарион", "Вит", "Виталий", "Витаутас", "Витольд", "Владимир", "Владислав", "Владлен", "Влас",
                "Воислав", "Володар", "Вольга", "Вольдемар", "Всеволод", "Всеслав", "Вышеслав", "Вячеслав", "Габриель",
                "Гавриил", "Галактион", "Галим", "Гарри", "Гастон", "Гафур", "Гаян", "Гаяс", "Гедеон", "Гейдар",
                "Гелий", "Геннадий", "Генрих", "Георгий", "Геракл", "Геральд", "Герасим", "Герман", "Гермоген",
                "Геронтий", "Глеб", "Годфрид", "Гордей", "Гордон", "Горислав", "Гостомысл", "Градимир", "Грегор",
                "Григорий", "Гурий", "Гуруглы", "Густав", "Давид", "Давлат", "Дамир", "Даниил", "Дасий", "Дементий",
                "Демид", "Демьян", "Денис", "Джабир", "Джамал", "Джамил", "Джамшид", "Джанузак", "Джафар", "Джованни", "Джордан", "Диас", "Див", "Дид", "Дильмурат", "Динасий", "Дитмар", "Дмитрий", "Доброслав", "Добрыня", "Дональд", "Донат", "Донатос", "Дормидонт", "Дорофей", "Драгомил", "Драгомир", "Дружина", "Евгений", "Евграф", "Евдоким", "Евлампий", "Евсей", "Евстафий", "Евстигней", "Евстрат", "Егор", "Елдос", "Елизар", "Елисей", "Емельян", "Епифан", "Ералы", "Еремей", "Ермак", "Ермил", "Ермолай", "Ерофей", "Ефим", "Ефрем", "Жан", "Жантуар", "Ждан", "Жерар", "Жорж", "Загид", "Задмард", "Зайнал", "Закир", "Замир", "Зафар", "Захар", "Захария", "Звяга", "Зенон", "Зигмунд", "Зиновий", "Зосима", "Иакинф", "Ибрагим", "Иван", "Иво", "Игнат", "Игорь", "Иероним", "Измаил", "Израиль", "Изяслав", "Иларий", "Илиан", "Илларион", "Ильгам", "Илья", "Ильяр", "Иннокентий", "Ион", "Ионос", "Иосиф", "Ипат", "Ипполит", "Ираклий", "Иржи", "Ирмен", "Иса", "Исаак", "Исай", "Исидор", "Искандер", "Иувеналий", "Кадри", "Казимир", "Каллистрат", "Камилл", "Камиль", "Капитон", "Карен", "Карл", "Карло", "Карп", "Касим", "Касьян", "Ким", "Киприан", "Кирилл", "Кирьян", "Клавдий", "Клемент", "Клим", "Клод", "Кондрат", "Конкордий", "Конон", "Конрад", "Константин", "Корней", "Корнелий", "Кристиан", "Кристоф", "Кронид", "Ксанф", "Ксенофонт", "Кузьма", "Кустодий", "Лабута", "Лавр", "Лаврентий", "Ладимир", "Лазарь", "Лев", "Леван", "Лель", "Ленар", "Леон", "Леонард", "Леонид", "Леонтий", "Леопольд", "Леча", "Любомир", "Людвиг", "Лука", "Лукьян", "Люсьен", "Маврикий", "Мадияр", "Мадлен", "Май", "Макар", "Максим", "Максимилиан", "Малик", "Мамед", "Манил", "Мансур", "Мануил", "Марат", "Мариан", "Мариус", "Марк", "Маркелл", "Марсель", "Мартин", "Мартьян", "Маскут", "Матвей", "Махмуд", "Медард", "Мелентий", "Мелитон", "Мераб", "Меркурий", "Мефодий", "Мечеслав", "Милан", "Мирза", "Мирон", "Мирослав", "Мисаил", "Митрофан", "Михаил", "Михей", "Мичлов", "Модест", "Моисей", "Мстислав", "Мурат", "Муслим", "Мустафа", "Мухтар", "Назар", "Назарий", "Назым", "Наил", "Нарцисс", "Натан", "Наум", "Нестор", "Никандр", "Никанор", "Никита", "Никифор", "Никодим", "Николай", "Никон", "Нил", "Нисон", "Нифонт", "Норберт", "Норман", "Овидий", "Одинец", "Олан", "Олаф", "Олег", "Олесь", "Олимпий", "Онисим", "Орест", "Осип", "Оскар", "Остап", "Остромир", "Павел", "Памфил", "Панкрат", "Пантелей", "Парамон", "Парух", "Парфен", "Патрик", "Патрикей", "Пахом", "Петр", "Пимен", "Платон", "Поликарп", "Помпей", "Порфирий", "Потап", "Пров", "Прокл", "Прокофий", "Протас", "Прохор", "Равиль", "Радий", "Радислав", "Радомир", "Раис", "Райнгольд", "Ратибор", "Ратмир", "Рауф", "Рафаил", "Рафик", "Рахман", "Рашид", "Реймонд", "Рейнольд", "Рем", "Ринат", "Рифат", "Рихард", "Ричард", "Роберт", "Родион", "Ролан", "Роман", "Рональд", "Ростислав", "Рубен", "Рудольф", "Руслан", "Рустам", "Рюрик", "Сабир", "Савва", "Савелий", "Салман", "Самсон", "Самуил", "Сармат", "Сархат", "Саттар", "Святополк", "Святослав", "Севастьян", "Северин", "Северьян", "Семен", "Серапион", "Серафим", "Сергей", "Сила", "Сильвестр", "Сократ", "Соломон", "Софрон", "Спартак", "Спиридон", "Стакрат", "Станимир", "Станислав", "Степан", "Стивен", "Стоян", "Султан", "Сухраб", "Таврион", "Таис", "Талик", "Тамаз", "Танир", "Тарас", "Тариэль", "Твердислав", "Тельман", "Теодор", "Терентий", "Тибор", "Тигран", "Тигрий", "Тимон", "Тимофей", "Тимур", "Тит", "Тихон", "Томас", "Трифон", "Трофим", "Ульманас", "Ульрих", "Ульян", "Урман", "Устин", "Фаддей", "Фаиз", "Фалалей", "Фарид", "Фархад", "Федор", "Федот", "Феликс", "Фелициан", "Феодосий", "Феоктист", "Феофан", "Феофил", "Ферапонт", "Фердинанд", "Фидель", "Филарет", "Филимон", "Филипп", "Фирс", "Флор", "Флорентий", "Фома", "Фортунат", "Фотий", "Франц", "Фридрих", "Фуад", "Хаким", "Халид", "Халик", "Хамид", "Харвей", "Харитон", "Харольд", "Христиан", "Христос", "Христофор", "Худаяр", "Цезарь", "Чеслав", "Шами", "Шамиль", "Шакур", "Эдвард", "Эдгар", "Эдмунд", "Эдуард", "Эльдар", "Эмиль", "Эммануил", "Эразм", "Эраст", "Эрик", "Эрнест", "Юджин", "Юлиан", "Юлий", "Юрий", "Юхим", "Язид", "Яким", "Яков", "Ян", "Янис", "Януарий", "Яромир", "Ярополк", "Ярослав", "Ясон"};
    }

    private String[] loadPatronymicNames() {
        return new String[]{"Александрович", "Адамович", "Анатольевич", "Аркадьевич", "Алексеевич", "Андреевич", "Артемович", "Альбертович", "Антонович", "Богданович", "Богуславович", "Борисович", "Вадимович", "Васильевич", "Владимирович", "Валентинович", "Вениаминович", "Вячеславович", "Валерьевич", "Викторович", "Геннадиевич", "Георгиевич", "Геннадьевич", "Григорьевич", "Давидович", "Денисович", "Данилович", "Дмитриевич", "Евгеньевич", "Егорович", "Ефимович", "Иванович", "Ильич", "Игоревич", "Иосифович", "Кириллович", "Константинович", "Леонидович", "Львович", "Макарович", "Максович", "Миронович", "Максимович", "Матвеевич", "Михайлович", "Натанович", "Наумович", "Николаевич", "Олегович", "Оскарович", "Павлович", "Петрович", "Платонович", "Робертович", "Ростиславович", "Рудольфович", "Романович", "Рубенович", "Русланович", "Святославович", "Сергеевич", "Степанович", "Семенович", "Станиславович", "Тарасович", "Тимофеевич", "Тимурович", "Федорович", "Феликсович", "Филиппович", "Харитонович", "Эдуардович", "Эмануилович", "Эльдарович", "Юрьевич", "Юхимович", "Яковлевич", "Ярославович"};
    }

    private String[] loadLastNames() {
        return new String[]{"Иванов", "Смирнов", "Кузнецов", "Попов", "Васильев", "Петров", "Соколов", "Михайлов", "Новиков", "Федоров", "Морозов", "Волков", "Алексеев", "Лебедев", "Семенов", "Егоров", "Павлов", "Козлов", "Степанов", "Николаев", "Орлов", "Андреев", "Макаров", "Никитин", "Захаров", "Зайцев", "Соловьев", "Борисов", "Яковлев", "Григорьев", "Романов", "Воробьев", "Сергеев", "Кузьмин", "Фролов", "Александров", "Дмитриев", "Королев", "Гусев", "Киселев", "Ильин", "Максимов", "Поляков", "Сорокин", "Виноградов", "Ковалев", "Белов", "Медведев", "Антонов", "Тарасов", "Жуков", "Баранов", "Филиппов", "Комаров", "Давыдов", "Беляев", "Герасимов", "Богданов", "Осипов", "Сидоров", "Матвеев", "Титов", "Марков", "Миронов", "Крылов", "Куликов", "Карпов", "Власов", "Мельников", "Денисов", "Гаврилов", "Тихонов", "Казаков", "Афанасьев", "Данилов", "Савельев", "Тимофеев", "Фомин", "Чернов", "Абрамов", "Мартынов", "Ефимов", "Федотов", "Щербаков", "Назаров", "Калинин", "Исаев", "Чернышев", "Быков", "Маслов", "Родионов", "Коновалов", "Лазарев", "Воронин", "Климов", "Филатов", "Пономарев", "Голубев", "Кудрявцев", "Прохоров", "Наумов", "Потапов", "Журавлев", "Овчинников", "Трофимов", "Леонов", "Соболев", "Ермаков", "Колесников", "Гончаров", "Емельянов", "Никифоров", "Грачев", "Котов", "Гришин", "Ефремов", "Архипов", "Громов", "Кириллов", "Малышев", "Панов", "Моисеев", "Румянцев", "Акимов", "Кондратьев", "Бирюков", "Горбунов", "Анисимов", "Еремин", "Тихомиров", "Галкин", "Лукьянов", "Михеев", "Скворцов", "Юдин", "Белоусов", "Нестеров", "Симонов", "Прокофьев", "Харитонов", "Князев", "Цветков", "Левин", "Митрофанов", "Воронов", "Аксенов", "Софронов", "Мальцев", "Логинов", "Горшков", "Савин", "Краснов", "Майоров", "Демидов", "Елисеев", "Рыбаков", "Сафонов", "Плотников", "Демин", "Хохлов", "Фадеев", "Молчанов", "Игнатов", "Литвинов", "Ершов", "Ушаков", "Дементьев", "Рябов", "Мухин", "Калашников", "Леонтьев", "Лобанов", "Кузин", "Корнеев", "Евдокимов", "Бородин", "Платонов", "Некрасов", "Балашов", "Бобров", "Жданов", "Блинов", "Игнатьев", "Коротков", "Муравьев", "Крюков", "Беляков", "Богомолов", "Дроздов", "Лавров", "Зуев", "Петухов", "Ларин", "Никулин", "Серов", "Терентьев", "Зотов", "Устинов", "Фокин", "Самойлов", "Константинов", "Сахаров", "Шишкин", "Самсонов", "Черкасов", "Чистяков", "Носов", "Спиридонов", "Карасев", "Авдеев", "Воронцов", "Зверев", "Владимиров", "Селезнев", "Нечаев", "Кудряшов", "Седов", "Фирсов", "Андрианов", "Панин", "Головин", "Терехов", "Ульянов", "Шестаков", "Агеев", "Никонов", "Селиванов", "Баженов", "Гордеев", "Кожевников", "Пахомов", "Зимин", "Костин", "Широков", "Филимонов", "Ларионов", "Овсянников", "Сазонов", "Суворов", "Нефедов", "Корнилов", "Любимов", "Львов", "Горбачев", "Копылов", "Лукин", "Токарев", "Кулешов", "Шилов", "Большаков"};
    }

    @Override
    public List<Person> dumpPersons() {
        return em.createNamedQuery("Person.findAll").getResultList();
    }
}
